bandmanager/app/controllers/bands_controller.rb

SELECT * FROM "bands"
---
  def index
    @bands = Band.all

SELECT * FROM "bands" WHERE ("bands"."id" = 2053932785)
---
  def show
    @band = Band.find(params[:id])

SELECT * FROM "countries"
SELECT * FROM "genres"
---
  def new
    @band = Band.new
    @countries = Country.all
    @genres = Genre.all

SELECT * FROM "bands" WHERE ("bands"."id" = 2053932785)
SELECT * FROM "countries"
SELECT * FROM "genres"
---
  def edit
    @band = Band.find(params[:id])

    @countries = Country.all
    @genres = Genre.all

INSERT INTO "bands" ("name", "city", "created_at", "genre_id", "updated_at", "country_id", "about", "year") VALUES('Violator', 'Brasília', '2009-11-20 20:38:28', 1, '2009-11-20 20:38:28', 1, 'Sobre o Violator', 2002)
SELECT * FROM "countries"
SELECT * FROM "genres"
---
  def create
    @band = Band.new(params[:band])

    if @band.save
      flash[:notice] = get_message "band.save"
      redirect_to bands_path
    else
      @countries = Country.all
      @genres = Genre.all

SELECT * FROM "bands" WHERE ("bands"."id" = 2053932785)
UPDATE "bands" SET "updated_at" = '2009-11-20 20:45:03', "genre_id" = NULL, "country_id" = NULL WHERE "id" = 1
SELECT * FROM "countries"
SELECT * FROM "genres"
---
  def update
    @band = Band.find(params[:id])

    begin
      @band.update_attributes!(params[:band])

      flash[:notice] = get_message "band.update"
      redirect_to edit_band_path(@band)

    rescue ActiveRecord::RecordInvalid
      @countries = Country.all
      @genres = Genre.all

SELECT * FROM "bands" WHERE ("bands"."id" = 2053932785)
DELETE FROM "bands" WHERE "id" = 2053932785
---
  def destroy
    @band = Band.find(params[:id])
    @band.destroy