bandmanager/app/controllers/countries_controller.rb

SELECT * FROM "countries"
---
  def index
    @countries = Country.all

INSERT INTO "countries" ("name", "created_at", "updated_at") VALUES(NULL, '2009-11-27 18:32:33', '2009-11-27 18:32:33')
---
  def create
    @country = Country.new(params[:country])

    respond_to do |format|
      if @country.save

SELECT * FROM "countries" WHERE ("countries"."id" = 2053932785)
DELETE FROM "countries" WHERE "id" = 2053932785
---
  def destroy
    @country = Country.find(params[:id])
    @country.destroy