bandmanager/app/controllers/genres_controller.rb

  def index
    @genres = Genre.all
---
SELECT * FROM "genres"

  def create
    @genre = Genre.new(params[:genre])

    respond_to do |format|
      if @genre.save
---
INSERT INTO "genres" ("created_at", "title", "updated_at") VALUES('2009-11-27 18:32:33', NULL, '2009-11-27 18:32:33')