bandmanager/app/controllers/releases_controller.rb

  def index
    @releases = Release.all
---
SELECT * FROM "releases"

  def show
    @release = Release.find(params[:id])
---
SELECT * FROM "releases" WHERE ("releases"."id" = 2053932785)

  def edit
    @release = Release.find(params[:id])
---
SELECT * FROM "releases" WHERE ("releases"."id" = 2053932785)

  def create
    @release = Release.new(params[:release])

    respond_to do |format|
      if @release.save
---
INSERT INTO "releases" ("created_at", "title", "details", "updated_at", "year") VALUES('2009-11-27 18:32:33', NULL, NULL, '2009-11-27 18:32:33', NULL)

  def update
    @release = Release.find(params[:id])
---
SELECT * FROM "releases" WHERE ("releases"."id" = 2053932785)

  def destroy
    @release = Release.find(params[:id])
    @release.destroy
---
SELECT * FROM "releases" WHERE ("releases"."id" = 2053932785)
DELETE FROM "releases" WHERE "id" = 2053932785