bandmanager/app/controllers/songs_controller.rb

SELECT * FROM "songs" WHERE ("songs"."id" = 2053932785)
---
  def show
    @song = Song.find(params[:id])

SELECT * FROM "songs" WHERE ("songs"."id" = 2053932785)
---
  def edit
    @release = Release.find(params[:release_id])
    @band = @release.band
    @song = Song.find(params[:id])

INSERT INTO "songs" ("lyrics", "created_at", "title", "updated_at") VALUES(NULL, '2009-11-27 18:32:34', NULL, '2009-11-27 18:32:34')
---
  def create
    @release = Release.find(params[:release_id])
    @band = @release.band
    @song = Song.new(params[:song])

    @song.release = @release

    if @song.save

SELECT * FROM "songs" WHERE ("songs"."id" = 2053932785)
---
  def update
    @song = Song.find(params[:id])

SELECT * FROM "songs" WHERE ("songs"."id" = 2053932785)
DELETE FROM "songs" WHERE "id" = 2053932785
---
  def destroy
    @song = Song.find(params[:id])
    band = @song.release.band
    @song.destroy